/* Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
● 5, 25 -> да ● -4, 16 -> да ● 25, 5 -> да ● 8,9 -> нет */

Console.WriteLine("Введите первое число: ");
string number1 = Console.ReadLine();
Console.Write(MakeArray(number, count));
